PerformanceTest1/post-test.yml
config:
  target: https://postman-echo.com/
  phases:
    - duration: 5
      arrivalRate: 1
      name: Load Test
  payload:
    - path: "keywords.csv"
      fields:
        - "username" 
        - "password"
      order: sequence
  plugins:
    ensure: {}
  ensure:
    thresholds: 
      - http.response_time.p95: 1000
      - http.response_time.min: 150
      - http.response_time.max: 1000
      - http.response_time.p99: 1500
    conditions:
      - expression: vusers.failed == 0
      - expression: "http.request_rate >= 2 and http.response_time.max < 1000"
scenarios:
  - name: Getting and Posting resource
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.host"
              as: "host"
      - log: "Json value from response is: {{ request_body }}"
      - log: "Host value from response is: {{ host }}"